Revit 2026 API
EnergyDataSettings.PercentageSkylights Property
 Used for the conceptual energy model. The approximate percentage of the building roof surfaces in massing instances for the Conceptual Energy Analytical Model.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)
Syntax
public double PercentageSkylights { get; set; }
Public Property PercentageSkylights As Double
	Get
	Set
public:
property double PercentageSkylights {
	double get ();
	void set (double value);
}
member PercentageSkylights : float with get, set
Property Value
Double
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  When setting this property: The percentage skylights value is between 0.00 and 0.95.
Remarks
 This value is used to automatically model the skylights in massing instances when the Energy Analytical model is being created.
See Also
Reference
EnergyDataSettings Class
Autodesk.Revit.DB.Analysis Namespace